In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import math as m

# 1. Create a pandas dataframe having following structure

 float_col int_col str_col
 
0 0.1 1 a
1 0.2 2 b
2 0.2 6 None
3 10.1 8 c
4 NaN -1 a

In [2]:
stru = {'float_col':[0.1,0.2,0.2,10.1,''],'int_col':[1,2,6,8,-1],'str_col':['a','b','','c','a']}

In [3]:
pstru = pd.DataFrame(stru)

In [4]:
pstru

  float_col  int_col str_col
0       0.1        1       a
1       0.2        2       b
2       0.2        6
3      10.1        8       c
4                 -1       a

In [5]:
pstru['float_col']=np.where(pstru['float_col']=='',0,pstru['float_col'])
pstru['float_col'].astype(np.int64)

0     0
1     0
2     0
3    10
4     0
Name: float_col, dtype: int64

# 2. filter the columns 'float_col', 'int_col' from the dataframe in one query. Hint-use ix method of dataframes. Also print without using ix method.

In [6]:
pstru.ix[:,['float_col','int_col']]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

  float_col  int_col
0       0.1        1
1       0.2        2
2       0.2        6
3      10.1        8
4         0       -1

In [7]:
pstru.query('float_col==0.2' and 'int_col==6')

  float_col  int_col str_col
2       0.2        6

In [8]:
pstru.query('float_col==0.2' or 'int_col==6')

  float_col  int_col str_col
1       0.2        2       b
2       0.2        6

# 3. filter the records from float_col having value greater than 0.15 and in separate query filter float_col value equal to 0.1

In [9]:
pstru.query('float_col>0.15')

  float_col  int_col str_col
1       0.2        2       b
2       0.2        6
3      10.1        8       c

In [10]:
pstru.query('float_col==0.1')

  float_col  int_col str_col
0       0.1        1       a

In [11]:
pstru.dtypes

float_col    object
int_col       int64
str_col      object
dtype: object

# 4. filter the records from data frame which satisfies both the conditions float_col greater than 0.1 and int_col greater than 2

In [12]:
pstru.query('float_col>0.1' and 'int_col>2')

  float_col  int_col str_col
2       0.2        6
3      10.1        8       c

# 5. filter the records from data frame which satisfies both the conditions float_col greater than 0.1 or int_col greater than 2

In [13]:
pstru.query('float_col>0.1' or 'int_col>2')

  float_col  int_col str_col
1       0.2        2       b
2       0.2        6
3      10.1        8       c

# 6. filter the records from data frame which satisfies the conditions float_col not greater than 0.1

In [14]:
pstru.query('float_col!=0.1')

  float_col  int_col str_col
1       0.2        2       b
2       0.2        6
3      10.1        8       c
4         0       -1       a

# 7. Create a new data frame in which column int_col is renamed to new_name.

In [15]:
stru1 = {'float_col':[0.1,0.2,0.2,10.1,'Nan'],'int_col':[1,2,6,8,-1],'str_col':['a','b','None','c','a']}
pstru1=pd.DataFrame(stru1)
pstru1['float_col']=np.where(pstru1['float_col']=='NaN',0,pstru1['float_col'])
pstru1['float_col'] = pstru1['float_col'].astype(np.float64)
pstru1

   float_col  int_col str_col
0        0.1        1       a
1        0.2        2       b
2        0.2        6    None
3       10.1        8       c
4        NaN       -1       a

# 8. Modify the existing data frame and rename the column int_col to new_name

In [16]:
ppstru1=pstru1.rename(columns={'int_col':'new_name'})
ppstru1.dtypes

float_col    float64
new_name       int64
str_col       object
dtype: object

# 9. Drop the rows where any value is missing from the data frame

In [17]:
p = pstru1.dropna(subset=['float_col'])
q = p.dropna(subset=['str_col'])

In [18]:
q

   float_col  int_col str_col
0        0.1        1       a
1        0.2        2       b
2        0.2        6    None
3       10.1        8       c

# 10. Change the missing value in column float_col as mean value of the float_col

In [19]:
a = pstru1['float_col'].mean()
a

2.65

In [20]:
pstru1['float_col']

0     0.1
1     0.2
2     0.2
3    10.1
4     NaN
Name: float_col, dtype: float64

In [21]:
pstru1['float_col']=pstru1['float_col'].fillna(a)

In [22]:
pstru1

   float_col  int_col str_col
0       0.10        1       a
1       0.20        2       b
2       0.20        6    None
3      10.10        8       c
4       2.65       -1       a

# 11. change all the values of str_col with new value and drop the missing values. New value should have prefix map_ and original value. Eg map_a, map_b

In [23]:
pstru1['str_col'].unique()

array(['a', 'b', 'None', 'c'], dtype=object)

In [24]:
pstru2 = pstru1.mask(pstru1.eq('None')).dropna()
x = pstru2
x

   float_col  int_col str_col
0       0.10        1       a
1       0.20        2       b
3      10.10        8       c
4       2.65       -1       a

In [25]:
pstru3 = pstru2
pstru3['str_col']=['map_'+x for x in pstru3['str_col']]

In [26]:
pstru3

   float_col  int_col str_col
0       0.10        1   map_a
1       0.20        2   map_b
3      10.10        8   map_c
4       2.65       -1   map_a

# 12. group all the values of str_col and find the mean of float_col in all the groups respectively.

In [27]:
pd.DataFrame(pstru3.groupby('str_col').float_col.mean())

         float_col
str_col
map_a        1.375
map_b        0.200
map_c       10.100

# 13. find the covariance of float_col and int_col

In [28]:
np.cov(pstru3[['float_col','int_col']])

array([[ 0.405  ,  0.81   , -0.945  , -1.6425 ],
       [ 0.81   ,  1.62   , -1.89   , -3.285  ],
       [-0.945  , -1.89   ,  2.205  ,  3.8325 ],
       [-1.6425 , -3.285  ,  3.8325 ,  6.66125]])

# 14. find the correlation of float_col and int_col

In [29]:
pstru3[['float_col','int_col']].corr()

           float_col   int_col
float_col   1.000000  0.841307
int_col     0.841307  1.000000

# 15. Create a data frame ‘other’ having columns some_val and str_col having values given below


some_val str_col

0 1 a

1 2 b

Perform inner join, outer join, left join and right join with data frame x

In [30]:
other = {'some_val':[1,2],'str_col':['a','b']}
other=pd.DataFrame(other)

In [31]:
other

   some_val str_col
0         1       a
1         2       b

In [32]:
x

   float_col  int_col str_col
0       0.10        1   map_a
1       0.20        2   map_b
3      10.10        8   map_c
4       2.65       -1   map_a

In [33]:
leftjoin = pd.merge(other,x[['float_col', 'int_col', 'str_col']],on='str_col',how='left')

In [34]:
leftjoin.reindex(columns=['str_col','some_val','float_col','int_col'])

  str_col  some_val  float_col  int_col
0       a         1        NaN      NaN
1       b         2        NaN      NaN

In [35]:
rightjoin = pd.merge(other,x[['float_col', 'int_col', 'str_col']],on='str_col',how='right')

In [36]:
rightjoin.reindex(columns=['str_col','some_val','float_col','int_col'])

  str_col  some_val  float_col  int_col
0   map_a       NaN       0.10        1
1   map_a       NaN       2.65       -1
2   map_b       NaN       0.20        2
3   map_c       NaN      10.10        8

In [37]:
outerjoin = pd.merge(other,x[['float_col', 'int_col', 'str_col']],on='str_col',how='outer')

In [38]:
outerjoin.reindex(columns=['str_col','some_val','float_col','int_col'])

  str_col  some_val  float_col  int_col
0       a       1.0        NaN      NaN
1       b       2.0        NaN      NaN
2   map_a       NaN       0.10      1.0
3   map_a       NaN       2.65     -1.0
4   map_b       NaN       0.20      2.0
5   map_c       NaN      10.10      8.0

In [39]:
innerjoin = pd.merge(other,x[['float_col', 'int_col', 'str_col']],on='str_col',how='inner')

In [40]:
innerjoin.reindex(columns=['str_col','some_val','float_col','int_col'])

Empty DataFrame
Columns: [str_col, some_val, float_col, int_col]
Index: []

# 16.When we want to send the same invitations to many people, the body of the mail does not change. Only the name (and maybe address) needs to be changed. Mail merge is a process of doing this. Instead of writing each mail separately, we have a template for body of the mail and a list of names that we merge together to form all the mails.

Create a text file “names.txt” having the names.

Anil,sunita,suman,lokesh,Sumita,John,Johny

Create a text file “body.txt” having the body of email.

I am going to Delhi. Lets meet on 7th Jan 2018

Have a great day

Regards

Team Victory

Write a program which should create separate files Anil.txt, sunita.txt, suman.txt
etc after picking names from names.txt. content of these files looks like –
Anil.txt
-----------------------
Hello Anil
I am going to Delhi. Lets meet on 7th Jan 2018
Have a great day
Regards
Team Victory
------------------------
sunita.txt
-----------------------
Hello Anil
I am going to Delhi. Lets meet on 7th Jan 2018
Have a great day
Regards
Team Victory
------------------------

In [41]:
list = ['Anil','sunita','suman','lokesh','Sumita','John','Johny']
#list2.to_csv('names.txt')
for i in list:
    f= open(i+".txt","w+")
    f.write("Hello "+i+",\n"+'I am going to Delhi. Lets meet on 7th Jan 2018.'+'\nHave a great day'+'\nRegards'+'\nTeam Victory')
    f.close()
    #print(i)